---
kind: type
id: T:Autodesk.Revit.DB.IFC.IFCFile
source: html/6f327830-5053-cf5d-c50e-2f5ab037b0b5.htm
---
# Autodesk.Revit.DB.IFC.IFCFile

Represents the IFC file which is being created during export.

## Syntax (C#)
```csharp
public class IFCFile : IDisposable
```